Revit 2027 API
MetallicPaint.MetallicpaintTopcoat Property
 The property labeled "Top Coat" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetallicpaintTopcoat { get; }
Public Shared ReadOnly Property MetallicpaintTopcoat As String
	Get
public:
static property String^ MetallicpaintTopcoat {
	String^ get ();
}
static member MetallicpaintTopcoat : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintTopcoatType".
See Also
Reference
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace